cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# tap "hashicorp/tap" # for waypoint
tap "sanemat/font" # for Ricty
tap "yoheimuta/protolint" # for protolint

# Terminal
brew "bat"
brew "fzf"
brew "exa"
brew "fd"
brew "jq"
brew "grpcurl"
brew "ripgrep"
brew "starship"
cask "iterm2"
brew "bash-completion"

brew "aquaproj/aqua/aqua"
brew "procs"
brew "bandwhich"
brew "cjbassi/ytop/ytop"

# Programming Languages
brew "goenv", args: ['HEAD']
# brew "rbenv", args: ['HEAD']
brew "pyenv", args: ['HEAD']
brew "protolint"

# Programming Fonts
brew "ricty"
cask "font-ricty-diminished"

# DataBase
brew "postgresql"
cask "postico"

# Git
brew "gh"
brew "ghq"
brew "git"
brew "tig"

# Docker
brew "docker"
brew "podman"
brew "lazydocker"

# k8s
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "stern"
brew "helm"
brew "kustomize"
brew "skaffold"
cask "lens"

brew "kind" # Kubernetes in Docker
brew "kubeseal" # https://github.com/bitnami-labs/sealed-secrets
brew "kubevela" # https://github.com/oam-dev/kubevela
brew "kubespy"
brew "derailed/k9s/k9s"
brew "tektoncd-cli"

# ansible
brew "ansible"

# terraform
brew "tfenv"
brew "tflint"
# brew "hashicorp/tap/waypoint" # https://www.waypointproject.io/docs/intro
# brew "terragrunt"  # automatic install specific terraform version

# cloud
cask "google-cloud-sdk"
brew "awscli"
cask "aws-vault"

# vagrant
cask "vagrant"
cask "virtualbox"

# Applications
cask "google-chrome"
cask "slack"
cask "visual-studio-code"

# Tools
cask "clipy"
cask "google-japanese-ime"
