# Level: A
brew "awscli"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "ripgrep"
brew "starship"
brew "stern"
brew "tfenv"
brew "tig"
brew "uv"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "claude-code"
cask "docker-desktop"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "google-chrome"
cask "google-japanese-ime"
cask "ghostty"
cask "raycast"
cask "slack"
cask "visual-studio-code"

# Level: B
brew "grpcurl"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kustomize"
brew "yooooooga/tap/zabrze"
cask "obsidian"

# Level: C
brew "codex"
brew "gemini-cli"
brew "ghq"
brew "volta"
cask "warp"