brew "awscli"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "jq"
brew "ripgrep"
brew "starship"
brew "tfenv"
brew "tig"
brew "uv"
brew "yq"
brew "yooooooga/tap/zabrze"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "docker-desktop"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "google-chrome"
cask "google-japanese-ime"
cask "ghostty"
cask "obsidian"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "warp"

# k8s tools
brew "grpcurl"
brew "helm"
brew "kubernetes-cli"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kustomize"
brew "stern"

# VSCode Extensions
vscode "alefragnani.bookmarks"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jebbs.plantuml"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "securisec.github-actions"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
