cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# OS X App
brew "bash-completion"
brew "gcc"
brew "git"
brew "gist"
brew "tig"
brew "tree"
brew "goenv", args: ['HEAD']
brew "rbenv", args: ['HEAD']
brew "pyenv", args: ['HEAD']

# Docker/k8s
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kubens"
brew "stern"

# DB
brew "postgresql"

# ansible/terraform
brew "ansible"
brew "tfenv"

# Cask App (軽そうなものが上)
cask "clipy"
cask "github"
cask "google-japanese-ime"
cask "ngrok"
cask "slack"
cask "virtualbox"
cask "docker" # Docker for Mac
cask "vagrant"
cask "visual-studio-code"
cask "google-chrome"
cask "postico"

