christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
donjayamanne.githistory
eamodio.gitlens
emilast.LogFileHighlighter
Gruntfuggly.todo-tree
humao.rest-client
mechatroner.rainbow-csv
MS-CEINTL.vscode-language-pack-ja
ms-vscode.Go
rebornix.ruby
ryu1kn.partial-diff
shardulm94.trailing-spaces
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby
