MS-CEINTL.vscode-language-pack-ja
vscode-icons-team.vscode-icons
christian-kohler.path-intellisense
davidhouchin.whitespace-plus
CoenraadS.bracket-pair-colorizer
mechatroner.rainbow-csv
ryu1kn.partial-diff
shardulm94.trailing-spaces
emilast.LogFileHighlighter
donjayamanne.githistory
eamodio.gitlens
ms-vscode.Go
rebornix.ruby
ms-python.python
njpwerner.autodocstring
himanoa.python-autopep8
freakypie.code-python-isort
xabikos.javascriptsnippets
ms-azuretools.vscode-docker
william-voyek.vscode-nginx
Gruntfuggly.todo-tree
humao.rest-client
